#+TITLE: DM1 Week 02 Prepare and Teach
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2018-02-06 Tue 14:58]
| Headline                |   Time |      |
|-------------------------+--------+------|
| *Total time*            | *1:43* |      |
|-------------------------+--------+------|
| Prepare                 |   0:32 |      |
| \_  Answer What is True |        | 0:32 |
| Teach                   |   1:11 |      |
#+END:
* Instructions
  See [[file:../week00/00-ponder--prove.org]]

* Prepare
** DONE Answer What is True
   CLOSED: [2018-01-22 Mon 13:53]
   :LOGBOOK:
   CLOCK: [2018-01-22 Mon 13:21]--[2018-01-22 Mon 13:53] =>  0:32
   :END:
   Check the box if you can truthfully assert that you did any of the following
   before Week 02 Day 1 class starting time.
  - [X] I reviewed my solution to last week\rsquo{}s /problem of the hats/.
  - [X] I identified the \ldquo{}key move\rdquo required to see the answer, and came
    prepared to articulate it if called upon.
  - [X] I watched [[https://www.ted.com/talks/matt_goldman_the_search_for_aha_moments?utm_source=tedcomshare&utm_medium=email&utm_campaign=tedspread--b][the recent TED talk by Matt Goldman]].
  - [X] I found and watched one other TED talk about grit and perseverance.
  - [X] I thought about how the Blue School principles are related to the
    BYU-Idaho Learning Model.
  - [X] I found two or three classmates to form a team for an in-class exercise.
  - [X] I encouraged them to be to class early so as to have time to set up two
    tables and sit facing each other.

* Teach
  :LOGBOOK:
  CLOCK: [2018-01-23 Tue 12:45]--[2018-01-23 Tue 13:56] =>  1:11
  :END:
  To quote from last week\rsquo{}s /problem of the hats/:

#+BEGIN_QUOTE
  Once you are given the facts of the case, be aware of how you attack the
  problem, how you take it apart, what you place emphasis on, your avenues of
  pursuit, and plausible conjectures. The answer requires \ldquo{}seeing\rdquo a key move.
#+END_QUOTE

  Keep that advice in mind as you prepare for this in-class \ldquo{}attack\rdquo.

  All the facts will not be given to you right now, but here is an outline of
  this problem (puzzle?):

#+begin_note
  A census-taker knocks on a door, and asks the woman inside how many children
  she has and how old they are.

  \ldquo{}I have 3 daughters, their ages are whole numbers, and the product of their
  ages is 36,\rdquo says the mother.

  \ldquo{}That\rsquo{}s not enough information,\rdquo responds the census-taker.

  \ldquo{}I\rsquo{}d tell you the sum of their ages, but you\rsquo{}d still be stumped.\rdquo

  \ldquo{}I wish you\rsquo{}d tell me something more.\rdquo

  \ldquo{}Okay, my oldest daughter likes cats.\rdquo

  What are the ages of the daughters?
#+end_note

  The values of =nd=, =pa=, and =sm= will be revealed in class.

#+begin_info

  9 2 2 have a sum of 13, and their product is 36.
  The sum of 6 6 1 is also 13, so there is no way to know unless you have more info.
  When you know that the oldest likes cats, you know that there is an oldest (not two) and that her age is 9.
  Thus, their ages are 9 2 2.

#+end_info
